Revit 2027 API
ParameterTypeId.PathReinSpanlengthTopAlt Property
 "Top (Alternating Bar)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinSpanlengthTopAlt { get; }
Public Shared ReadOnly Property PathReinSpanlengthTopAlt As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinSpanlengthTopAlt {
	ForgeTypeId^ get ();
}
static member PathReinSpanlengthTopAlt : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace